# 1) შექმენით ფუნქცია greet და დააბრუნეთ მისასალმებელი ტექსტი return ის საშუალებით

def greet():
    return "hello"
print(greet())
    
# 2) შექმენით ფუნქცია add რომელსაც გადაეცემა ორი პარამეტრი num1 და num2 შემდეგ კი დააბრუნეთ მათი ჯამი

def add(num1, num2):
    return num1 + num2
print(add(32,567))

# 3) შექმენით ფუნქცია multiply რომელსაც გადაეცემა ორი რიცხვი შემდეგ კი დააბრუნეთ მათი ნამრავლი

def multiply(num1, num2):
    return num1 * num2 
print(multiply(89,64))

# 4) კომენტარებით ახსენით რაა არის არგუმენტი, რა არის პარამეტრი და რატომ ვიყენებთ ფუნქციებს

# არგუმენტი არის რარაც მნიშვნელობა რომელსაც გადავცემთ ფრჩხილებში ფუნქციას მისი გამოზახების დროს.
# პარამეტრი არის ცვლადი რომელიც ფუნქციის შექმნის დროს გამოიყენება.

# ჩვენ ვიყენებთ ფუნქციებს იმისათვის რომ გავამარტივოთ ჩვენივე კოდი.