# 1)შექმენით სია რომელიც შედგება სახელებისგან, შემდეგ დაბეჭდეთ ტერმინალში ამ სიიდან მხოლოდ პირველი და ბოლო ელემენტი

name = ["giorgi", "nika", "sandro", "mate", "zura", "gocha"]
print(name[::5])


# 2)შექმენით სია რომელიც შედგება ხილის სახელებისგან, დაბეჭდეთ ბოლო და ბოლოს წინა ელემენტი უარყოფითი ინდექსების საშუალებით

fruits = ["apple", "banana", "orange", "peach"]
print(fruits[-2:5])


# 3)მომხმარებელს შემოატანინეთ მისი სახელი და შეინახეთ ცვლადში შემდეგ გამოიტანეთ ამ სახელის პირველი და ბოლო ასო

name = "Nika"
print(name[::3])


# 4)შექმენით სია რომელიც შედგება ადამიანის სახელებისგან გამოიტანე სიის მე2 ელემენტიდან მე5 ელემენტის ჩათვლით ყველა ელემენტი (გამოიყენეთ slicing)

names = ["giorgi" "mate", "saba", "zurab", "sandro", "khvicha"]
print(names[1:5])
