# 2)1)შექმენი ცვლადი რომელსაც გადაეცემა პატარა ასოებით დაწერილი სტრინგი,შენი დავალებაა დააბრუნო ეს სტრინგი ოღონდ uppercase ში გადაყვანილი
#   2)შექმენი ცვლადი რომელსაც გადაეცემა  დიდი ასოებით დაწერილი სტრინგი,შენი დავალებაა დააბრუნო ეს სტრინგი ოღონდ lowercase ში გადაყვანილი
#   3)შექმენი ცვლადი რომელსაც გადაეცემა პატარა ასოებით დაწერილი სტრინგი,შენი დავალებაა დააბრუნო ეს სტრინგი ისე რომ პირველი ასო იყოს დიდი
#   4)შექმენი ცვლადი რომელსაც გადაეცემა სტრინგი --> "კაიპურისჭამა" , შენი დავალებაა ამ სტრინგიდან გაიგო რომელ ინდექსზე დგას ასო "ჭ" და ასო "პ"


name = "giorgi"
print(name.upper())


name1 = "SANDRO"
print(name1.lower())


name2 = "khvicha"
print(name2.capitalize())


word = "კაიპურისჭამა"
index = word.find("ჭ")
index_1 = word.find("პ")
print(index)
print(index_1)
